# Exploratory Data Analysis

In [1]:
import pandas as pd

In [5]:
df = pd.read_csv("../../data/review-data.csv", index_col=0)

In [6]:
df.head()

        Username             WineName          Winery  Rating
0    Joel Miller  Clos de Tafall 2017  Clos Berenguer     4.5
1  Frank Webster  Clos de Tafall 2017  Clos Berenguer     4.5
2     Emil Bojar  Clos de Tafall 2017  Clos Berenguer     4.5
3       Mike Bor  Clos de Tafall 2017  Clos Berenguer     4.5
4     ! DALLAS !  Clos de Tafall 2017  Clos Berenguer     4.5

In [7]:
num_users = len(df["Username"].unique())
print("Total unique users: ", num_users)

Total unique users:  323242

In [8]:
num_wines = len(df["WineName"].unique())
print("Total unique wines: ", num_wines)

Total unique wines:  638

In [14]:
wine_rating_count_df = df.filter(["WineName", "Rating"], axis=1).groupby("WineName").count().reset_index()
wine_rating_count_df = wine_rating_count_df.sort_values("Rating", ascending=False)
wine_rating_count_df

                            WineName  Rating
97           Cabernet Sauvignon 2017   19852
337                      Malbec 2018   14445
433                  Pinot Noir 2018   14034
96           Cabernet Sauvignon 2016   11241
587                     Toscana 2015    9320
..                               ...     ...
151                    Cinsault 2018      18
576           The Looking Glass 2017      15
318       Le Tithonien Mondeuse 2018      15
536        Signature Pinot Noir 2016      11
119  Cellar Hand Punch Down Red 2015      10

[638 rows x 2 columns]

In [16]:
user_rating_count_df = df.filter(["Username", "Rating"], axis=1).groupby("Username").count().reset_index()
user_rating_count_df = user_rating_count_df.sort_values("Rating", ascending=False)
user_rating_count_df[user_rating_count_df["Rating"] > 5]

                        Username  Rating
304808               Vivino User    2395
209544                   Michael     142
70013                      David     131
316857               vivino user     127
25899              Antonio Rollo     123
...                          ...     ...
183021               Luca Facchi       6
90467         Erik the Oenophile       6
293948                      Todd       6
261857               Rui Almeida       6
192208  Marcelo Monteiro de Melo       6

[16203 rows x 2 columns]